Cleanup files and Readme.md create
